%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%参数区%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 用于选定TYPE:
% 其中，0 - 原桁架， 1 - 增添模型1， 2 - 增添模型2， 3 - 增添模型3
TYPE = 1;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%main%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

x = (0:0.0001:0.06);
Fs1 = calc(TYPE, 0);
Fs2 = calc(TYPE, 0.9);

% disp(Fs1);
% disp(Fs2);

ys = zeros(24, 601);
maxy = zeros(1, 601);  % store the maxvalue of Ys
mark = zeros(1, 601);
marked = zeros(1, 24);
for i = 1: 24
    y = -((Fs2(i) - Fs1(i)) .* x ./ 0.06 + Fs1(i)); % 修正为向内取正（只考虑受压力的最大值）
    ys(i, :) = y;
    if i <= 21
        maxy = max(maxy, y);
    end
    % disp(maxy);
    for j = 1:601
        if maxy(j) == y(j)
           if i <= 21
                mark(j) = i;
           end
        end
    end
    % maxy = max(maxy, -y); % abs
end

% showAll(x, Fs1, Fs2);
sep_plot(mark, x, maxy);

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%函数区%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% 获得type下的矩阵
function ret = get_matrix(type)
    sint = 3 / 5;
    cost = 4 / 5;
    sinp = (4-sqrt(3)) / sqrt(28 - 8*sqrt(3));
    cosp = 3 / sqrt(28 - 8*sqrt(3));
    sin30 = 1/2;
    cos30 = sqrt(3)/2;
    switch type
        case 0
            ret = [
                1	-sin30	sinp	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	cos30	cosp	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                1	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	0	0	1	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	sin30	0	0	1	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	cos30	0	0	0	-1	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	0	sinp	0	1	0	cost	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	0	cosp	1	0	0	-sint	-1	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	0	0	0	0	0	cost	0	1	0	cost	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	0	0	0	0	1	sint	0	0	-1	-sint	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	0	0	0	0	0	0	0	1	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	0	0	0	0	0	0	1	0	0	0	-1	0	0	0	0	0	0	0	0	0	0	0	0;
                0	0	0	0	0	0	0	0	0	0	0	0	1	0	0	0	0	0	0	0	0	0	0	0;
                0	0	0	0	0	0	0	0	0	1	0	0	0	-1	0	0	0	0	0	0	0	0	0	0;
                0	0	0	0	0	0	0	0	0	0	cost	0	1	0	cost	0	0	0	0	0	0	0	0	0;
                0	0	0	0	0	0	0	0	0	0	sint	1	0	0	-sint	-1	0	0	0	0	0	0	0	0;
                0	0	0	0	0	0	0	0	0	0	0	0	0	0	cost	0	1	0	0	0	0	0	0	0;
                0	0	0	0	0	0	0	0	0	0	0	0	0	1	sint	0	0	-1	0	0	0	0	0	0;
                0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	1	0	cost	0	0	0	0	0;
                0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	-1	0	0	sint	1	0	0	0	0;
                0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	cost	0	1	0	0	0;
                0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	1	sint	0	0	-1	0	0;
                0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	1	0	1	0;
                0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	1	0	0	0	-1

            ];
            
        case 1
            ret = [
                1	-sin30	sinp	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	cos30	cosp	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                1	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	0	0	1	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	sin30	0	0	1	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	cos30	0	0	0	-1	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	0	sinp	0	1	0	cost	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	0	cosp	1	0	0	-sint	-1	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	0	0	0	0	0	cost	0	1	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	0	0	0	0	1	sint	0	0	-1	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	0	0	0	0	0	0	0	1	0	cost	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	0	0	0	0	0	0	1	0	0	-sint	-1	0	0	0	0	0	0	0	0	0	0	0	0;
                0	0	0	0	0	0	0	0	0	0	cost	0	1	0	0	0	0	0	0	0	0	0	0	0;
                0	0	0	0	0	0	0	0	0	1	sint	0	0	-1	0	0	0	0	0	0	0	0	0	0;
                0	0	0	0	0	0	0	0	0	0	0	0	1	0	cost	0	0	0	0	0	0	0	0	0;
                0	0	0	0	0	0	0	0	0	0	0	1	0	0	-sint	-1	0	0	0	0	0	0	0	0;
                0	0	0	0	0	0	0	0	0	0	0	0	0	0	cost	0	1	0	0	0	0	0	0	0;
                0	0	0	0	0	0	0	0	0	0	0	0	0	1	sint	0	0	-1	0	0	0	0	0	0;
                0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	1	0	cost	0	0	0	0	0;
                0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	1	0	0	-sint	-1	0	0	0	0;
                0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	cost	0	1	0	0	0;
                0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	1	sint	0	0	-1	0	0;
                0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	1	0	1	0;
                0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	1	0	0	0	-1
            ];
        case 2
            ret = [
                1	-sin30	sinp	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	cos30	cosp	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                1	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	0	0	1	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	sin30	0	0	1	0	cost	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	cos30	0	0	0	-1	-sint	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	0	sinp	0	1	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	0	cosp	1	0	0	0	-1	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	0	0	0	0	0	0	0	1	0	cost	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	0	0	0	0	1	0	0	0	-1	-sint	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	0	0	0	0	0	cost	0	1	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	0	0	0	0	0	sint	1	0	0	0	-1	0	0	0	0	0	0	0	0	0	0	0	0;
                0	0	0	0	0	0	0	0	0	0	0	0	1	0	cost	0	0	0	0	0	0	0	0	0;
                0	0	0	0	0	0	0	0	0	1	0	0	0	-1	-sint	0	0	0	0	0	0	0	0	0;
                0	0	0	0	0	0	0	0	0	0	cost	0	1	0	0	0	0	0	0	0	0	0	0	0;
                0	0	0	0	0	0	0	0	0	0	sint	1	0	0	0	-1	0	0	0	0	0	0	0	0;
                0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	1	0	cost	0	0	0	0	0;
                0	0	0	0	0	0	0	0	0	0	0	0	0	1	0	0	0	-1	-sint	0	0	0	0	0;
                0	0	0	0	0	0	0	0	0	0	0	0	0	0	cost	0	1	0	0	0	0	0	0	0;
                0	0	0	0	0	0	0	0	0	0	0	0	0	0	sint	1	0	0	0	-1	0	0	0	0;
                0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	1	0	0	0;
                0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	1	0	0	0	-1	0	0;
                0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	cost	0	1	0	1	0;
                0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	sint	1	0	0	0	-1
            ];
        case 3
            ret = [
                1	-sin30	sinp	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	cos30	cosp	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                1	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	0	0	1	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	sin30	0	0	1	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	cos30	0	0	0	-1	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	0	sinp	0	1	0	cost	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	0	cosp	1	0	0	-sint	-1	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	0	0	0	0	0	cost	0	1	0	cost	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	0	0	0	0	1	sint	0	0	-1	-sint	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	0	0	0	0	0	0	0	1	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0;
                0	0	0	0	0	0	0	1	0	0	0	-1	0	0	0	0	0	0	0	0	0	0	0	0;
                0	0	0	0	0	0	0	0	0	0	0	0	1	0	0	0	0	0	0	0	0	0	0	0;
                0	0	0	0	0	0	0	0	0	1	0	0	0	-1	0	0	0	0	0	0	0	0	0	0;
                0	0	0	0	0	0	0	0	0	0	cost	0	1	0	cost	0	0	0	0	0	0	0	0	0;
                0	0	0	0	0	0	0	0	0	0	sint	1	0	0	-sint	-1	0	0	0	0	0	0	0	0;
                0	0	0	0	0	0	0	0	0	0	0	0	0	0	cost	0	1	0	cost	0	0	0	0	0;
                0	0	0	0	0	0	0	0	0	0	0	0	0	1	sint	0	0	-1	-sint	0	0	0	0	0;
                0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	1	0	0	0	0	0	0	0;
                0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	1	0	0	0	-1	0	0	0	0;
                0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	1	0	0	0;
                0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	1	0	0	0	-1	0	0;
                0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	cost	0	1	0	1	0;
                0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	0	sint	1	0	0	0	-1
            ];
    end
end

% 计算在不同type、Q下，各个杆的受力，单位为P
function ret = calc(type, Q)
    b = [0; -1; -1; 0; 0; 0; Q; 0; 0; 0; 2*Q; 0; 0; 0; 2*Q-2; 0; 0; 0; 2*Q; 0; 0; 0; Q; 0];
    A = get_matrix(type);
    ret = A\b;
end

% 展示所有杆子受力情况图
function showAll(x, Fs1, Fs2)
    figure;
    hold on;
    for i = 1: 24
        y = -((Fs2(i) - Fs1(i)) .* x ./ 0.06 + Fs1(i)); % 修正为向内取正（只考虑受压力的最大值）
        plot(x, y);
    end
    legend("杆" + (1:24));
    xlabel("Q(/P)");
    ylabel("F(/P)");
    hold off;
end

% 用于显示各q(单位P)下，当时受压力最大的杆的序号
function sep_plot(mark, x, maxy)
    figure;
    hold on;
    lines = zeros(1, 601);
    leftBound = 1;
    rightBound = 1;
    curColor = mark(1);
    colorCnt = 1;
    lines(colorCnt) = mark(1);
    % disp(mark);
    for j = 2:601
        if curColor == mark(j)
            rightBound = rightBound + 1;
        else
            plot(x(leftBound: rightBound), maxy(leftBound: rightBound));
            rightBound = rightBound + 1;
            leftBound = rightBound;
            curColor = mark(j);
            colorCnt = colorCnt + 1;
            lines(colorCnt) = mark(j);
        end
    end
    % plot(x, maxy.');
    plot(x(leftBound: rightBound), maxy(leftBound: rightBound).')
    % legend("F" + (0: nMax));
    legend("杆"  + lines(1: colorCnt));
    xlabel("q(/P)");
    ylabel("F(/P)");
    hold off;
end